Revit 2026 API

# ElementIdParse Method

---

Parse the string representation of the id into a corresponding ElementId.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ElementId Parse(
	string idStr
)
```
```vb
Public Shared Function Parse (
	idStr As String
) As ElementId
```
```cpp
public:
static ElementId^ Parse(
	String^ idStr
)
```
```fsharp
static member Parse :
        idStr : string -> ElementId
```

#### Parameters

idStr String
    The string representation of the id to return.

#### Return Value

ElementIdElementId string represented.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the string cannot be parsed into an ElementId. |

If the string represents [!:Autodesk::Revit::DB::Element::InvalidElementId] it will be returned.

#### Reference

ElementId Class

Autodesk.Revit.DB Namespace